Repository: JTi65/blackbox-terminal
Catalog: po/*.po
Languages: fi

source: Terminal;terminal;shell;prompt;command;commandline;cmd;box;
fi: Pääte;pääte;kuori;kehote;komento;komentorivi;cmd;laatikko;

source: Window width
fi: Ikkunan leveys

source: Window height
fi: Ikkunan korkeus

source: Whether or not to remember window size
fi: Pitääkö ikkunan koko muistaa vai ei

source: Font family and size
fi: Fonttiperhe ja -koko

source: Whether the window should inherit terminal theme's colors
fi: Peritäänkö ikkunan pääteteeman värit

source: Terminal window background opacity
fi: Pääteikkunan taustan läpinäkyvyys

source: Whether or not tabs should expand to fill tab bar
fi: Pitääkö välilehdet laajentua täyttämään välilehtipalkki

source: Whether the headerbar should be shown or not
fi: Näytetäänkö otsikkopalkki vai ei

source: If enabled, the header bar will be colored differently for root and ssh contexts
fi: Jos käytössä, otsikkopalkki on eri värinen root- ja ssh-konteksteissa

source: Whether or not to display a menu button in the headerbar
fi: Näytetäänkö valikkopainike otsikkopalkissa vai ei

source: Whether or not to reserve an area for dragging the header bar
fi: Varataanko alue otsikkopalkin vetämistä varten vai ei

source: Whether or not to show scrollbars
fi: Näytetäänkö vierityspalkit vai ei

source: Whether overlay scrolling should be enabled
fi: Pitäisikö päällekkäisvieritys olla käytössä

source: If enabled, terminals will scroll by pixels instead of rows
fi: Jos käytössä, päätteet vierittävät pikseleinä rivien sijaan

source: If enabled, terminals will render sixel escape sequences
fi: Jos käytössä, päätelaitteet renderöivät sixel-koodinvaihtosekvenssit

source: Scrollback mode
fi: Takaisinrullaustila

source: Number of lines stored in scrollback
fi: Scrollbackiin tallennettujen rivien määrä

source: If enabled, floating controls will be shown in headerless mode
fi: Jos käytössä, kelluvat ohjausobjektit näytetään otsikottomassa tilassa

source: Hoverable area (in pixels) at the top of the window to trigger floating controls
fi: Ikkunan yläreunassa oleva leijuva alue (pikseleinä), jolla kelluvat säätimet voidaan aktivoida

source: Delay time before showing floating controls
fi: Viive ennen kelluvien säätimien näyttämistä

source: The light color scheme for the terminal
fi: Päätelaitteen vaalea värimaailma

source: The dark color scheme for the terminal
fi: Päätelaitteen tumma värimaailma

source: Style preference
fi: Tyylin valinta

source: Show bold text in bright colors
fi: Näytä lihavoitu teksti kirkkailla väreillä

source: Hide cursor while typing
fi: Piilota kohdistin kirjoitettaessa

source: Amount of padding around terminal widgets (top, right, bottom, left)
fi: Pääte-widgetien ympärillä olevan täyttömäärä (ylhäällä, oikealla, alhaalla, vasemmalla)

source: Terminal cell width
fi: Päätesolun leveys

source: Terminal cell height
fi: Päätesolun korjeus

source: Terminal bell
fi: Päätrlaitteen kello

source: Cursor shape
fi: Kursorin varjo

source: Whether or not the cursor should blink
fi: Pitäisikö kohdistimen vilkkua vai ei

source: If enabled, ctrl+c and ctrl+v will work for copy/paste
fi: Jos käytössä, ctrl+c ja ctrl+v toimivat kopioinnissa/liitämisessä

source: Whether to spawn shell in login mode
fi: Näytetäänkö komentotulkki kirjautumistilassa

source: Whether to use a custom command instead of the user's shell
fi: Käytetäänkö mukautettua komentoa käyttäjän komentotulkin sijaan

source: Custom command to use instead of the user's shell
fi: Mukautettu komento käyttäjän komentotulkin sijaan

source: Send a desktop notification when a process is completed on an unfocussed tab
fi: Lähetä työpöytäilmoitus, kun prosessi on valmis välilehdellä, jossa ei ole aktiivista

source: Working directory mode
fi: Työhakemistotila

source: Custom working directory for new terminals
fi: Mukautettu työhakemisto uusille päätteille

source: Whether clicking next on the last search result should return to the first
fi: Palaako seuraavaan napsauttamalla viimeisintä hakutulosta ensimmäiseen

source: Whether search should be case sensitive
fi: Pitäisikö haun kirjainkokoerotella

source: Whether search should only match entire words
fi: Pitäisikö haun löytää vain kokonaisia ​​sanoja

source: Whether search should be performed using regular expressions
fi: Pitäisikö haku suorittaa säännöllisten lausekkeiden avulla

source: Edit Shortcut
fi: Muokkaa pikanäppäimiä

source: Cancel
fi: Peruuta

source: Apply
fi: Hyväksy

source: This shortcut is already in use
fi: Tämä pikanäppäin on jo käytössä

source: Press Escape to cancel or Backspace to disable shortcut
fi: Paina Esc peruuttaaksesi tai Backspace poistaaksesi pikakuvakkeen käytöstä

source: Keyboard
fi: Näppäimistö

source: Shortcuts
fi: Pikanäppäimet

source: Reset All Shortcuts
fi: Palauta kaikki pikavalinnat

source: This will reset all shortcuts to their default keybindings and overwrite your config file.
fi: Tämä palauttaa kaikki pikanäppäimet oletusarvoihinsa ja korvaa asetustiedostosi.

source: Reset All
fi: Peruuta kaikki

source: Find
fi: Etsi

source: Previous result
fi: Edellinen tulos

source: Next result
fi: Seuraava tulos

source: Search wraps around
fi: Haku jatkuu

source: Match is case sensitive
fi: Tulos on kirjainkokoriippuvainen

source: Match entire words only
fi: Vain kokonaiset sanat

source: Match using regular expression
fi: Tulos säännöllisen lausekkeen avulla

source: General
fi: Yleinen

source: Window
fi: Ikkuna

source: Remember Window Size
fi: Muista ikkunan koko

source: Theme settings have been moved to Terminal > Appearance.
fi: Teeman asetukset on siirretty kohtaan Pääte > Ulkoasu.

source: Tabs
fi: Välilehdet

source: Expand Tabs
fi: Laajenna välilehdet

source: Header Bar
fi: Yläpalkki

source: Show Header Bar
fi: Näytä yläpalkki

source: Context Aware
fi: Kontekstitietoinen

source: If enabled, the header bar will be colored differently when the active tab is running ssh or sudo.
fi: Jos tämä on käytössä, otsikkopalkki värittyy eri tavalla, kun aktiivinen välilehti käyttää ssh:ta tai sudoa.

source: Show Menu Button
fi: Näytä Menu-painike

source: Drag Area
fi: Pudotusalue

source: Enable to reserve some space on the left side to drag the window.
fi: Ota käyttöön varataksesi tilaa vasemmalla puolella ikkunan vetämistä varten.

source: Floating Controls
fi: Kelluvat ohjausobjektit

source: Show Floating Controls
fi: Näytä kelluvat ohjausobjektit

source: Show floating controls when header bar is hidden.
fi: Näytä kelluvat ohjausobjektit, kun otsikkopalkki on piilotettu.

source: Floating Controls Hover Area
fi: Kelluvat ohjaimet kelluva-alue

source: Hoverable area (in pixels) at the top of the window to trigger floating controls.
fi: Ikkunan yläreunassa oleva leijuva alue (pikseleinä), jolla kelluvat säätimet voidaan aktivoida.

source: Delay Before Show Floating Controls
fi: Viive ennen kelluvien säätimien näyttämistä

source: Delay time (ms) before show floating controls.
fi: Viiveaika (ms) ennen kelluvien ohjausobjektien näyttämistä.

source: Terminal
fi: Terminaali

source: Text
fi: Teksti

source: Font
fi: Fontti

source: Cell Spacing
fi: Soluväli

source: Width
fi: Leveys

source: Height
fi: Korkeus

source: Bright Bold Text
fi: Kirkas lihavoitu teksti

source: Use bright colors for bold text.
fi: Käytä lihavoidulle tekstille kirkkaita värejä.

source: Easy Copy &amp; Paste
fi: Helppo kopioida ja liittää

source: Use ctrl+c/ctrl+v for copy/paste.
fi: Kopioi/liitä painamalla ctrl+c/ctrl+v.

source: Audible Bell
fi: Äänimerkki

source: If enabled, terminals might use an audible bell to indicate events.
fi: Jos käytössä, päätelaitteet saattavat käyttää äänimerkkiä tapahtumien ilmaisemiseen.

source: Cursor
fi: Kursori

source: Adjust cursor shape and behavior.
fi: Säädä kohdistimen muotoa ja toimintaa.

source: Cursor Shape
fi: Kohdistimen muoto

source: Block
fi: Esto

source: Underline
fi: Alleviivaus

source: Cursor Blinking
fi: Kursorin vilkunta

source: Whether or not the cursor should blink.
fi: Pitäisikö kohdistimen vilkkua vai ei.

source: Follow System
fi: Seuraa järjestelmää

source: Off
fi: Pois päältä

source: Autohide
fi: Piilota automaattisesti

source: Enable to hide the cursor while typing
fi: Ota käyttöön kohdistimen piilottaminen kirjoitettaessa

source: Padding
fi: Väli

source: Opacity
fi: Läpinäkyvyys

source: Terminal background opacity.
fi: Päätelaitteen taustan läpinäkyvyys.

source: Working Directory
fi: Työhakemisto

source: Previous Session
fi: Edellinen istunto

source: Home Directory
fi: Kotihakemisto

source: Custom
fi: Mukautettu

source: Custom Working Directory
fi: Mukautettu työhakemisto

source: Set to user's home
fi: Aseta käyttäjän kotikansioksi

source: Scrolling
fi: Vieritä

source: Scrollbars
fi: Vierityspalkit

source: Show Scrollbars
fi: Näytä vierityspalkit

source: Use Overlay Scrolling
fi: Käytä päällekkäisvieritystä

source: Fixed Size
fi: Muokattu koko

source: Unlimited
fi: Rajoittamaton

source: Disabled
fi: Poissa käytöstä

source: Scrollback Lines
fi: Vieritysviivat

source: Command
fi: Komento

source: Run Command as Login Shell
fi: Suorita komento kirjautumiskomentoina

source: Use Custom Command
fi: Käytä mukautettua komentoa

source: Custom Command
fi: Muokattu komento

source: Notification on Completed Task
fi: Ilmoitus suoritetusta tehtävästä

source: Send a desktop notification when a command is completed on an unfocussed tab.
fi: Lähetä työpöytäilmoitus, kun komento on suoritettu välilehdellä, jossa ei ole aktiivista.

source: Appearance
fi: Ulkonäkö

source: Application Style
fi: Sovelluksen tyyli

source: Light
fi: Vaalea

source: Dark
fi: Tumma

source: Theme Integration
fi: Teeman integrointi

source: Paint the whole app with colors from your colorscheme.
fi: Maalaa koko sovellus värimaailmasi väreillä.

source: Theme
fi: Teema

source: Set your preferred theme for light and dark styles.
fi: Aseta haluamasi teema vaaleille ja tummille tyyleille.

source: Open themes folder
fi: Avaa teemojen kansio

source: Get more themes online
fi: Hanki lisää teemoja verkosta

source: Light Theme
fi: Vaalea teema

source: Dark Theme
fi: Tumma teema

source: Only display themes for the current style
fi: Näytä vain nykyisen tyylin teemat

source: To ensure readability, "Theme Integration" will be disabled if you select a light color scheme while using the dark app style or a dark color scheme while using the light app style.
fi: Luettavuuden varmistamiseksi "Teeman integrointi" poistetaan käytöstä, jos valitset vaalean värimaailman tummaa sovellustyyliä käytettäessä tai tumman värimaailman vaaleaa sovellustyyliä käytettäessä.

source: Advanced
fi: Edistynyt

source: Experimental
fi: Kokeellinen

source: Features in this section are known to be unstable. Please feel free to test and <a href="https://gitlab.gnome.org/raggesilver/blackbox/-/issues">report bugs</a>.
fi: Tämän osion ominaisuuksien tiedetään olevan epävakaita. Voit vapaasti testata niitä ja <a href="https://gitlab.gnome.org/raggesilver/blackbox/-/issues">ilmoittaa virheistä</a>.

source: Sixel Support
fi: Sixel-tuki

source: Render sixel escape sequences.
fi: Renderöi sixel-koodinvaihtosekvenssit.

source: The VTE build you are using does not have support Sixel. Sixel is still an experimental feature in VTE. For this reason, most distros do not build VTE with Sixel support. Installing Black Box via Flatpak will enable this feature. <a href="https://gitlab.gnome.org/raggesilver/blackbox/-/issues/273">See discussion in issue tracker.</a>
fi: Käyttämäsi VTE-versio ei tue Sixeliä. Sixel on vielä kokeellinen ominaisuus VTE:ssä. Tästä syystä useimmat jakelut eivät käännä VTE:tä Sixel-tuella. Black Boxin asentaminen Flatpakin kautta ottaa tämän ominaisuuden käyttöön. <a href="https://gitlab.gnome.org/raggesilver/blackbox/-/issues/273">Katso keskustelu ongelmanseurannassa.</a>

source: Danger Zone
fi: Vaarallinen alue

source: Reset Preferences
fi: Palauta asetukset

source: This will revert all settings back to default. Your extra themes will not be removed.
fi: Tämä palauttaa kaikki asetukset oletusasetuksiin. Ylimääräisiä teemojasi ei poisteta.

source: Reset preferences
fi: Palauta asetukset

source: Open Link
fi: Avaa linkki

source: New Tab
fi: Uusi välilehti

source: New Window
fi: Uusi ikkuna

source: Copy
fi: Kopioi

source: Copy Link
fi: Kopioi linkki

source: Paste
fi: Liitä

source: Preferences
fi: Asetukset

source: Keyboard Shortcuts
fi: Pikanäppäimet

source: About Black Box
fi: Tietoja Black Box

# shortcut window
source: Window
fi: Ikkuna

# shortcut window
source: New window
fi: Uusi ikkuna

# shortcut window
source: New tab
fi: Uusi välilehti

# shortcut window
source: Close tab
fi: Sulje välilehti

# shortcut window
source: Rename tab
fi: Uudelleen nimeä välilehti

# shortcut window
source: Switch headbar mode
fi: Vaihda pääpalkin tilaa

# shortcut window
source: Toggle fullscreen
fi: Koko näytön vaihto

# shortcut window
source: Terminal
fi: Terminaali

# shortcut window
source: Search
fi: Etsi

# shortcut window
source: Copy
fi: Kopioi

# shortcut window
source: Paste
fi: Liitä

# shortcut window
source: Zoom in
fi: Lähennä

# shortcut window
source: Zoom out
fi: Loitonna

# shortcut window
source: Reset zoom
fi: Palauta zoomi

# shortcut window
source: Navigation
fi: Navigointi

# shortcut window
source: Focus next tab
fi: Siirrä seuraava välilehti kohdistetuksi

# shortcut window
source: Focus previous tab
fi: Siirrä edellinen välilehti kohdistetuksi

# shortcut window
source: Switch to Tab 1
fi: Vaihda välilehdelle 1

# shortcut window
source: Switch to Tab 2
fi: Vaihda välilehdelle 2

# shortcut window
source: Switch to Tab 3
fi: Vaihda välilehdelle 3

# shortcut window
source: Switch to Tab 4
fi: Vaihda välilehdelle 4

# shortcut window
source: Switch to Tab 5
fi: Vaihda välilehdelle 5

# shortcut window
source: Switch to Tab 6
fi: Vaihda välilehdelle 6

# shortcut window
source: Switch to Tab 7
fi: Vaihda välilehdelle 7

# shortcut window
source: Switch to Tab 8
fi: Vaihda välilehdelle 8

# shortcut window
source: Switch to Tab 9
fi: Vaihda välilehdelle 9

# shortcut window
source: Switch to last Tab
fi: Vaihda viimeiseen välilehteen

# shortcut window
source: General
fi: Yleinen

# shortcut window
source: Show Shortcuts
fi: Näytä pikanäppäimet

# shortcut window
source: Edit Preferences
fi: Muokkaa asetuksia

source: Move Tab Left
fi: Siirrä välilehti vasemmalle

source: Move Tab Right
fi: Siirrä välilehti oikealle

source: Rename Tab
fi: Uudelleen nimeä välilehti

source: Move Tab to New Window
fi: Siirrä välilehti uuteen ikkunaan

source: Close Tab
fi: Sulje välilehti

source: Remote Access
fi: Etäkäyttö

source: SSH Connections
fi: SSH-yhteydet

source: New Connection
fi: Uusi yhteys

source: SFTP Servers
fi: SFTP Serveriit

source: Fullscreen
fi: Koko näyttö

source: Exit Fullscreen
fi: Lopeta koko näyttö

source: Menu
fi: Valikko

source: Use System Colors
fi: Käytä järjestelmän värejä

source: Use Light Colors
fi: Käytä vaaleita värejä

source: Use Dark Colors
fi: Käytä tummia värejä

source: Replace keybinding?
fi: Korvataanko näppäinyhdistelmä?

source: %s is already assigned to %s
fi: %s on jo määritetty käyttäjälle %s

source: You can still access the menu by right-clicking any terminal.
fi: Voit edelleen käyttää valikkoa napsauttamalla hiiren kakkospainikkeella mitä tahansa päätettä.

source: %s uses an early Gtk 4 port of VTE as a terminal widget. While a lot of progress has been made on this port, copying has yet to be implemented. This means there's currently no way to copy text in %s.
fi: %s käyttää VTE:n varhaista Gtk 4 -porttia päätewidgetinä. Vaikka tässä portissa on edistytty paljon, kopiointia ei ole vielä toteutettu. Tämä tarkoittaa, että tekstiä ei tällä hetkellä voi kopioida %s:ssä.

source: Warning: unlimited scrollback saves content to disk, which may cause your system to run out of storage.
fi: Varoitus: rajoittamaton vieritys taaksepäin tallentaa sisältöä levylle, mikä voi aiheuttaa järjestelmän tallennustilan loppumisen.

source: No
fi: Ei

source: Yes
fi: Kyllä

source: Keep
fi: Pidä

source: Replace
fi: Korvaa

source: Close
fi: Sulje

source: Close Tab?
fi: Sulje välilehti?

source: Close Window?
fi: Sulje ikkuna?

source: Some commands are still running. Closing this tab will kill them and may lead to unexpected outcomes.
fi: Jotkin komennot ovat edelleen käynnissä. Tämän välilehden sulkeminen lopettaa ne ja voi johtaa odottamattomiin tuloksiin.

source: Some commands are still running. Closing this window will kill them and may lead to unexpected outcomes.
fi: Jotkin komennot ovat edelleen käynnissä. Tämän ikkunan sulkeminen lopettaa ne ja voi johtaa odottamattomiin tuloksiin.

source: invalid keybinding
fi: virheellinen näppäinsidonta

source: Donate
fi: Lahjoita

source: Full Changelog
fi: Koko muutosloki

source: Terminal Font
fi: Päätteen fontti

source: Are you sure you want to reset all settings?
fi: Haluatko varmasti nollata kaikki asetukset?

source: Reuse previous tab's directory.
fi: Käytä uudelleen edellisen välilehden hakemistoa.

source: Use the current user's home as working directory.
fi: Käytä nykyisen käyttäjän kotihakemistoa työhakemistona.

source: Use a custom path as working directory.
fi: Käytä työhakemistona mukautettua polkua.

source: Enter new shortcut
fi: Syötä uusi pikanäppäin

source: Enter new shortcut for "%s"
fi: Anna uusi pikanäppäin kohteelle "%s"

source: Add Keybinding
fi: Lisää näppäinyhdistelmä

source: Reset Keybindings
fi: Palauta näppäinyhdistelmät

source: Remove %s
fi: Poista %s

source: Focus Next Tab
fi: Kohdista uuteen välilehteen

source: Focus Previous Tab
fi: Kohdista edelliseen välilehteen

source: Toggle Header Bar
fi: Yläpalkki päälle/pois

source: Search
fi: Etsi

source: Zoom In
fi: Lähennä

source: Zoom Out
fi: Loitonna

source: Reset Zoom
fi: Palauta zoomi

source: Switch to Tab %u
fi: Vaihda välilehdelle %u

source: Switch to Last Tab
fi: Vaihda viimeiseen välilehteen

source: Reset All Shortcuts?
fi: Palauta kaikki pikavalinnat?

source: This will reset all shortcuts to default and overwrite your config file. This action is irreversible.
fi: Tämä palauttaa kaikki pikavalinnat oletusarvoihinsa ja korvaa asetustiedostosi. Tätä toimintoa ei voi peruuttaa.

source: Reset
fi: Palauta

source: tab
fi: vVälilehti

source: Error
fi: Virhe

source: Set a custom title for this tab
fi: Aseta tälle välilehdelle mukautettu otsikko

source: Enter a custom tab title
fi: Anna mukautettu välilehden otsikko

source: Reset Title
fi: Palauta otsikko

source: Set Title
fi: Aseta otsikko

source: Command completed
fi: Komento suoritettu

source: Show app version
fi: Näytä sovellusversio

source: Set current working directory
fi: Aseta nykyinen työhakemisto

source: Execute command in a terminal
fi: Suorita komento terminaalissa

source: Show help
fi: Näytä ohjeet

source: Run %s --help to get help
fi: Suorita %s --help saadaksesi apua
